; domain
(define (domain satellite-typed)
(:requirements :equality :strips :typing)
(:types satellite
        direction
        instrument
        mode)
(:predicates
 (on_board ?i - instrument ?s - satellite)
 (supports ?i - instrument ?m - mode)
 (pointing ?s - satellite ?d - direction)
 (power_avail ?s - satellite)
 (power_on ?i - instrument)
 (calibrated ?i - instrument)
 (have_image ?d - direction ?m - mode)
 (calibration_target ?i - instrument ?d - direction))

(:action turn_to
 :parameters ( ?s - satellite ?d_new ?d_prev - direction)
 :precondition
 (and
      (pointing ?s ?d_prev)
      )
 :effect
 (and (pointing ?s ?d_new)
      (not (pointing ?s ?d_prev))))

(:action switch_on
 :parameters (?i - instrument ?s - satellite)
 :precondition
 (and (on_board ?i ?s)
      (power_avail ?s))
 :effect
 (and (power_on ?i)
      (not (calibrated ?i))
      (not (power_avail ?s))))

(:action switch_off
 :parameters (?i - instrument ?s - satellite)
 :precondition
	(and (on_board ?i ?s)
             (power_on ?i))
 :effect
	(and (power_avail ?s)
             (not (power_on ?i))))

(:action calibrate
 :parameters (?i - instrument ?s - satellite ?d - direction)
 :precondition
	(and (on_board ?i ?s)
             (calibration_target ?i ?d)
             (pointing ?s ?d)
             (power_on ?i))
 :effect
	 (calibrated ?i))

(:action take_image
 :parameters (?i - instrument ?s - satellite ?d - direction ?m - mode)
 :precondition
	(and (calibrated ?i)
             (on_board ?i ?s)
             (supports ?i ?m)
             (power_on ?i)
             (pointing ?s ?d))
 :effect
	 (have_image ?d ?m))

)

; problem
(DEFINE (PROBLEM SATELLITE-TYPED-S-1-I-2-M-10-S-5-D-20)
 (:DOMAIN SATELLITE-TYPED)
 (:OBJECTS SATELLITE-0 - SATELLITE INSTRUMENT-0 INSTRUMENT-1 - INSTRUMENT
  MODE-0 MODE-1 MODE-2 MODE-3 MODE-4 MODE-5 MODE-6 MODE-7 MODE-8 MODE-9 - MODE
  STATION-0 STATION-1 STATION-2 STATION-3 STATION-4 DIRECTION-0 DIRECTION-1
  DIRECTION-2 DIRECTION-3 DIRECTION-4 DIRECTION-5 DIRECTION-6 DIRECTION-7
  DIRECTION-8 DIRECTION-9 DIRECTION-10 DIRECTION-11 DIRECTION-12 DIRECTION-13
  DIRECTION-14 DIRECTION-15 DIRECTION-16 DIRECTION-17 DIRECTION-18 DIRECTION-19
  - DIRECTION)
 (:INIT (POWER_AVAIL SATELLITE-0) (POINTING SATELLITE-0 DIRECTION-5)
  (ON_BOARD INSTRUMENT-0 SATELLITE-0)
  (CALIBRATION_TARGET INSTRUMENT-0 STATION-0)
  (ON_BOARD INSTRUMENT-1 SATELLITE-0)
  (CALIBRATION_TARGET INSTRUMENT-1 STATION-2) (SUPPORTS INSTRUMENT-0 MODE-0)
  (SUPPORTS INSTRUMENT-0 MODE-1) (SUPPORTS INSTRUMENT-1 MODE-2)
  (SUPPORTS INSTRUMENT-0 MODE-3) (SUPPORTS INSTRUMENT-1 MODE-4)
  (SUPPORTS INSTRUMENT-0 MODE-5) (SUPPORTS INSTRUMENT-0 MODE-6)
  (SUPPORTS INSTRUMENT-0 MODE-7) (SUPPORTS INSTRUMENT-1 MODE-8)
  (SUPPORTS INSTRUMENT-1 MODE-9))
 (:GOAL
  (AND (HAVE_IMAGE DIRECTION-0 MODE-0) (HAVE_IMAGE DIRECTION-1 MODE-1)
       (HAVE_IMAGE DIRECTION-2 MODE-3) (HAVE_IMAGE DIRECTION-3 MODE-6)
       (HAVE_IMAGE DIRECTION-4 MODE-4) (HAVE_IMAGE DIRECTION-5 MODE-8)
       (HAVE_IMAGE DIRECTION-6 MODE-4) (HAVE_IMAGE DIRECTION-7 MODE-5)
       (HAVE_IMAGE DIRECTION-8 MODE-1) (HAVE_IMAGE DIRECTION-9 MODE-2)
       (HAVE_IMAGE DIRECTION-10 MODE-5) (HAVE_IMAGE DIRECTION-11 MODE-0)
       (HAVE_IMAGE DIRECTION-12 MODE-7) (HAVE_IMAGE DIRECTION-13 MODE-0)
       (HAVE_IMAGE DIRECTION-14 MODE-7) (HAVE_IMAGE DIRECTION-15 MODE-8)
       (HAVE_IMAGE DIRECTION-16 MODE-4) (HAVE_IMAGE DIRECTION-17 MODE-0)
       (HAVE_IMAGE DIRECTION-18 MODE-4) (HAVE_IMAGE DIRECTION-19 MODE-9))))

; plan
1. (switch_on instrument-1 satellite-0)
   deleted: (power_avail satellite-0)
   added: (power_on instrument-1)
   goals met: 0 of 20
2. (turn_to satellite-0 station-2 direction-5)
   deleted: (pointing satellite-0 direction-5)
   added: (pointing satellite-0 station-2)
   goals met: 0 of 20
3. (calibrate instrument-1 satellite-0 station-2)
   added: (calibrated instrument-1)
   goals met: 0 of 20
4. (turn_to satellite-0 direction-9 station-2)
   deleted: (pointing satellite-0 station-2)
   added: (pointing satellite-0 direction-9)
   goals met: 0 of 20
5. (take_image instrument-1 satellite-0 direction-9 mode-2)
   added: (have_image direction-9 mode-2)
   goals met: 1 of 20
6. (turn_to satellite-0 direction-6 direction-9)
   deleted: (pointing satellite-0 direction-9)
   added: (pointing satellite-0 direction-6)
   goals met: 1 of 20
7. (take_image instrument-1 satellite-0 direction-6 mode-4)
   added: (have_image direction-6 mode-4)
   goals met: 2 of 20
8. (turn_to satellite-0 direction-5 direction-6)
   deleted: (pointing satellite-0 direction-6)
   added: (pointing satellite-0 direction-5)
   goals met: 2 of 20
9. (take_image instrument-1 satellite-0 direction-5 mode-8)
   added: (have_image direction-5 mode-8)
   goals met: 3 of 20
10. (turn_to satellite-0 direction-4 direction-5)
   deleted: (pointing satellite-0 direction-5)
   added: (pointing satellite-0 direction-4)
   goals met: 3 of 20
11. (take_image instrument-1 satellite-0 direction-4 mode-4)
   added: (have_image direction-4 mode-4)
   goals met: 4 of 20
12. (turn_to satellite-0 direction-19 direction-4)
   deleted: (pointing satellite-0 direction-4)
   added: (pointing satellite-0 direction-19)
   goals met: 4 of 20
13. (take_image instrument-1 satellite-0 direction-19 mode-9)
   added: (have_image direction-19 mode-9)
   goals met: 5 of 20
14. (turn_to satellite-0 direction-18 direction-19)
   deleted: (pointing satellite-0 direction-19)
   added: (pointing satellite-0 direction-18)
   goals met: 5 of 20
15. (take_image instrument-1 satellite-0 direction-18 mode-4)
   added: (have_image direction-18 mode-4)
   goals met: 6 of 20
16. (turn_to satellite-0 direction-16 direction-18)
   deleted: (pointing satellite-0 direction-18)
   added: (pointing satellite-0 direction-16)
   goals met: 6 of 20
17. (take_image instrument-1 satellite-0 direction-16 mode-4)
   added: (have_image direction-16 mode-4)
   goals met: 7 of 20
18. (turn_to satellite-0 direction-15 direction-16)
   deleted: (pointing satellite-0 direction-16)
   added: (pointing satellite-0 direction-15)
   goals met: 7 of 20
19. (take_image instrument-1 satellite-0 direction-15 mode-8)
   added: (have_image direction-15 mode-8)
   goals met: 8 of 20
20. (switch_off instrument-1 satellite-0)
   deleted: (power_on instrument-1)
   added: (power_avail satellite-0)
   goals met: 8 of 20
21. (switch_on instrument-0 satellite-0)
   deleted: (power_avail satellite-0)
   added: (power_on instrument-0)
   goals met: 8 of 20
22. (turn_to satellite-0 station-0 direction-15)
   deleted: (pointing satellite-0 direction-15)
   added: (pointing satellite-0 station-0)
   goals met: 8 of 20
23. (calibrate instrument-0 satellite-0 station-0)
   added: (calibrated instrument-0)
   goals met: 8 of 20
24. (turn_to satellite-0 direction-8 station-0)
   deleted: (pointing satellite-0 station-0)
   added: (pointing satellite-0 direction-8)
   goals met: 8 of 20
25. (take_image instrument-0 satellite-0 direction-8 mode-1)
   added: (have_image direction-8 mode-1)
   goals met: 9 of 20
26. (turn_to satellite-0 direction-7 direction-8)
   deleted: (pointing satellite-0 direction-8)
   added: (pointing satellite-0 direction-7)
   goals met: 9 of 20
27. (take_image instrument-0 satellite-0 direction-7 mode-5)
   added: (have_image direction-7 mode-5)
   goals met: 10 of 20
28. (turn_to satellite-0 direction-3 direction-7)
   deleted: (pointing satellite-0 direction-7)
   added: (pointing satellite-0 direction-3)
   goals met: 10 of 20
29. (take_image instrument-0 satellite-0 direction-3 mode-6)
   added: (have_image direction-3 mode-6)
   goals met: 11 of 20
30. (turn_to satellite-0 direction-2 direction-3)
   deleted: (pointing satellite-0 direction-3)
   added: (pointing satellite-0 direction-2)
   goals met: 11 of 20
31. (take_image instrument-0 satellite-0 direction-2 mode-3)
   added: (have_image direction-2 mode-3)
   goals met: 12 of 20
32. (turn_to satellite-0 direction-17 direction-2)
   deleted: (pointing satellite-0 direction-2)
   added: (pointing satellite-0 direction-17)
   goals met: 12 of 20
33. (take_image instrument-0 satellite-0 direction-17 mode-0)
   added: (have_image direction-17 mode-0)
   goals met: 13 of 20
34. (turn_to satellite-0 direction-14 direction-17)
   deleted: (pointing satellite-0 direction-17)
   added: (pointing satellite-0 direction-14)
   goals met: 13 of 20
35. (take_image instrument-0 satellite-0 direction-14 mode-7)
   added: (have_image direction-14 mode-7)
   goals met: 14 of 20
36. (turn_to satellite-0 direction-13 direction-14)
   deleted: (pointing satellite-0 direction-14)
   added: (pointing satellite-0 direction-13)
   goals met: 14 of 20
37. (take_image instrument-0 satellite-0 direction-13 mode-0)
   added: (have_image direction-13 mode-0)
   goals met: 15 of 20
38. (turn_to satellite-0 direction-12 direction-13)
   deleted: (pointing satellite-0 direction-13)
   added: (pointing satellite-0 direction-12)
   goals met: 15 of 20
39. (take_image instrument-0 satellite-0 direction-12 mode-7)
   added: (have_image direction-12 mode-7)
   goals met: 16 of 20
40. (turn_to satellite-0 direction-11 direction-12)
   deleted: (pointing satellite-0 direction-12)
   added: (pointing satellite-0 direction-11)
   goals met: 16 of 20
41. (take_image instrument-0 satellite-0 direction-11 mode-0)
   added: (have_image direction-11 mode-0)
   goals met: 17 of 20
42. (turn_to satellite-0 direction-10 direction-11)
   deleted: (pointing satellite-0 direction-11)
   added: (pointing satellite-0 direction-10)
   goals met: 17 of 20
43. (take_image instrument-0 satellite-0 direction-10 mode-5)
   added: (have_image direction-10 mode-5)
   goals met: 18 of 20
44. (turn_to satellite-0 direction-1 direction-10)
   deleted: (pointing satellite-0 direction-10)
   added: (pointing satellite-0 direction-1)
   goals met: 18 of 20
45. (take_image instrument-0 satellite-0 direction-1 mode-1)
   added: (have_image direction-1 mode-1)
   goals met: 19 of 20
46. (turn_to satellite-0 direction-0 direction-1)
   deleted: (pointing satellite-0 direction-1)
   added: (pointing satellite-0 direction-0)
   goals met: 19 of 20
47. (take_image instrument-0 satellite-0 direction-0 mode-0)
   added: (have_image direction-0 mode-0)
   goals met: 20 of 20
